# Project Title
### Data Engineering Capstone Project

#### Project Summary
The project will develop a data warehouse having a single source of data coming from different data sources

The project follows the follow steps:
* Step 1: Scope the Project and Gather Data
* Step 2: Explore and Assess the Data
* Step 3: Define the Data Model
* Step 4: Run ETL to Model the Data
* Step 5: Complete Project Write Up

In [3]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import udf, date_add
from pyspark.sql.types import StringType
from pyspark.sql.types import IntegerType
from pyspark.sql.functions import desc
from pyspark.sql.functions import asc
from pyspark.sql.functions import sum as Fsum

import datetime
import numpy as np
import pandas as pd
import re

In [2]:
spark = SparkSession.builder.\
    config("spark.jars.repositories", "https://repos.spark-packages.org/").\
    config("spark.jars.packages", "saurfang:spark-sas7bdat:2.0.0-s_2.11").\
    enableHiveSupport().getOrCreate()

In [13]:
pd.set_option('display.max_columns', 50)

### Step 1: Scope the Project and Gather Data

#### Scope 
In the capstone project, we will work on the udacity provided dataset of immigration, demographics, airports and temperature and we will be looking into the relationship between the:

- Countries of immigrants and a specific port city.
- Demographics of port city and country of origin.
- Average temperature of country of origin and port city of entry.
- Inflow of immigrations in a given time of year or month and certain areas.


#### Describe and Gather Data 
- **I94 Immigration Data**: This data comes from the US National Tourism and Trade Office. 
- **World Temperature Data**: This dataset came from Kaggle.
- **U.S. City Demographic Data** : This data comes from OpenSoft.
- **Airport Code Table**: This is a simple table of airport codes and corresponding cities.

#### Explore sample immigration dataset

In [11]:
sample_immig_df = pd.read_csv("immigration_data_sample.csv")

In [5]:
sample_immig_df.head()

,Unnamed: 0,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,2027561,4084316.0,2016.0,4.0,209.0,209.0,HHW,20566.0,1.0,HI,20573.0,61.0,2.0,1.0,20160422,NaN,NaN,G,O,NaN,M,1955.0,07202016,F,NaN,JL,5.658267e+10,00782,WT
1,2171295,4422636.0,2016.0,4.0,582.0,582.0,MCA,20567.0,1.0,TX,20568.0,26.0,2.0,1.0,20160423,MTR,NaN,G,R,NaN,M,1990.0,10222016,M,NaN,*GA,9.436200e+10,XBLNG,B2
2,589494,1195600.0,2016.0,4.0,148.0,112.0,OGG,20551.0,1.0,FL,20571.0,76.0,2.0,1.0,20160407,NaN,NaN,G,O,NaN,M,1940.0,07052016,M,NaN,LH,5.578047e+10,00464,WT
3,2631158,5291768.0,2016.0,4.0,297.0,297.0,LOS,20572.0,1.0,CA,20581.0,25.0,2.0,1.0,20160428,DOH,NaN,G,O,NaN,M,1991.0,10272016,M,NaN,QR,9.478970e+10,00739,B2
4,3032257,985523.0,2016.0,4.0,111.0,111.0,CHM,20550.0,3.0,NY,20553.0,19.0,2.0,1.0,20160406,NaN,NaN,Z,K,NaN,M,1997.0,07042016,F,NaN,NaN,4.232257e+10,LAND,WT

In [6]:
sample_immig_df.shape

(1000, 29)

In [7]:
sample_immig_df['i94port'].unique()

array(['HHW', 'MCA', 'OGG', 'LOS', 'CHM', 'ATL', 'SFR', 'NYC', 'CHI',
       'PHI', 'FTL', 'BOS', 'SAI', 'NAS', 'SEA', 'ORL', 'PSP', 'HOU',
       'NEW', 'BAL', 'SNJ', 'DET', 'AGA', 'LVG', 'MIA', 'SDP', 'VCV',
       'DUB', 'PEM', 'TAM', 'BLA', 'WAS', 'KOA', 'DAL', 'SHA', 'SPM',
       'NIA', 'PHR', 'MIL', 'SLC', 'CLT', 'EPI', 'SNA', 'MON', 'DLR',
       'SFB', 'OPF', 'X96', 'CLM', 'LIH', 'DEN', 'PHO', 'POO', 'NOL',
       'WPB', 'PBB', 'TOR', 'MAA', 'RNO', 'FMY', 'HIG', 'OAK', 'OTM',
       'ONT', 'SRQ', 'LLB', 'NCA', 'SUM', 'STR', 'HAM'], dtype=object)

In [8]:
sample_immig_df['i94visa'].value_counts()

2.0    831
1.0    155
3.0     14
Name: i94visa, dtype: int64

#### Explore demographics dataset

In [9]:
demographics_df = pd.read_csv("us-cities-demographics.csv", delimiter=';')

In [10]:
demographics_df.head()

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,Silver Spring,Maryland,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.60,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129.0,49500.0,93629,4147.0,32935.0,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040.0,46799.0,84839,4819.0,8229.0,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127.0,87105.0,175232,5821.0,33878.0,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402

In [11]:
demographics_df.shape

(2891, 12)

In [12]:
demographics_df['State'].unique()

array(['Maryland', 'Massachusetts', 'Alabama', 'California', 'New Jersey',
       'Illinois', 'Arizona', 'Missouri', 'North Carolina', 'Pennsylvania',
       'Kansas', 'Florida', 'Texas', 'Virginia', 'Nevada', 'Colorado',
       'Michigan', 'Connecticut', 'Minnesota', 'Utah', 'Arkansas',
       'Tennessee', 'Oklahoma', 'Washington', 'New York', 'Georgia',
       'Nebraska', 'Kentucky', 'South Carolina', 'Louisiana', 'New Mexico',
       'Iowa', 'Rhode Island', 'Puerto Rico', 'District of Columbia',
       'Wisconsin', 'Oregon', 'New Hampshire', 'North Dakota', 'Delaware',
       'Ohio', 'Idaho', 'Indiana', 'Alaska', 'Mississippi', 'Hawaii',
       'South Dakota', 'Maine', 'Montana'], dtype=object)

In [13]:
demographics_df.columns

Index(['City', 'State', 'Median Age', 'Male Population', 'Female Population',
       'Total Population', 'Number of Veterans', 'Foreign-born',
       'Average Household Size', 'State Code', 'Race', 'Count'],
      dtype='object')

In [14]:
# for consistency lets rename columns
demographics_df.columns = ['city', 'state', 'median_age', 'male_population', 'female_population',
                           'total_population', 'number_of_veterans', 'foreign_born',
                           'average_household_size', 'state_code', 'race', 'count']

#### Explore airports dataset

In [15]:
airports_df = pd.read_csv("airport-codes_csv.csv")

In [16]:
airports_df.head()

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
0,00A,heliport,Total Rf Heliport,11.0,NaN,US,US-PA,Bensalem,00A,NaN,00A,"-74.93360137939453, 40.07080078125"
1,00AA,small_airport,Aero B Ranch Airport,3435.0,NaN,US,US-KS,Leoti,00AA,NaN,00AA,"-101.473911, 38.704022"
2,00AK,small_airport,Lowell Field,450.0,NaN,US,US-AK,Anchor Point,00AK,NaN,00AK,"-151.695999146, 59.94919968"
3,00AL,small_airport,Epps Airpark,820.0,NaN,US,US-AL,Harvest,00AL,NaN,00AL,"-86.77030181884766, 34.86479949951172"
4,00AR,closed,Newport Hospital & Clinic Heliport,237.0,NaN,US,US-AR,Newport,NaN,NaN,NaN,"-91.254898, 35.6087"

In [17]:
airports_df.columns

Index(['ident', 'type', 'name', 'elevation_ft', 'continent', 'iso_country',
       'iso_region', 'municipality', 'gps_code', 'iata_code', 'local_code',
       'coordinates'],
      dtype='object')

In [18]:
airports_df['type'].value_counts()

small_airport     33965
heliport          11287
medium_airport     4550
closed             3606
seaplane_base      1016
large_airport       627
balloonport          24
Name: type, dtype: int64

#### Explore temperature dataset

In [19]:
temperature_df = pd.read_csv('../../data2/GlobalLandTemperaturesByCity.csv')

In [18]:
temperature_df.shape

(8599212, 7)

In [19]:
temperature_df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

#### Actual immigration dataset

In [20]:
immigration_df = spark.read.format('com.github.saurfang.sas.spark').load('../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat')

In [21]:
immigration_df.printSchema()

root
 |-- cicid: double (nullable = true)
 |-- i94yr: double (nullable = true)
 |-- i94mon: double (nullable = true)
 |-- i94cit: double (nullable = true)
 |-- i94res: double (nullable = true)
 |-- i94port: string (nullable = true)
 |-- arrdate: double (nullable = true)
 |-- i94mode: double (nullable = true)
 |-- i94addr: string (nullable = true)
 |-- depdate: double (nullable = true)
 |-- i94bir: double (nullable = true)
 |-- i94visa: double (nullable = true)
 |-- count: double (nullable = true)
 |-- dtadfile: string (nullable = true)
 |-- visapost: string (nullable = true)
 |-- occup: string (nullable = true)
 |-- entdepa: string (nullable = true)
 |-- entdepd: string (nullable = true)
 |-- entdepu: string (nullable = true)
 |-- matflag: string (nullable = true)
 |-- biryear: double (nullable = true)
 |-- dtaddto: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- insnum: string (nullable = true)
 |-- airline: string (nullable = true)
 |-- admnum: double (nullable = true)
 |-- fltno: string (nullable = true)
 |-- visatype: string (nullable = true)

### Step 2: Explore and Assess the Data
#### Explore the Data 
Identify data quality issues, like missing values, duplicate data, etc.

#### Cleaning Steps
Document steps necessary to clean the data

#### Process I94_SAS_Labels_Descriptions

In [35]:
def process_sas_labels_descriptions():
    with open("I94_SAS_Labels_Descriptions.SAS", "r") as f:
        file = f.read()
        sas_data = {}
        temp_data = []
        for line in file.split("\n"):
            line = re.sub(r"\s+", " ", line)
            if "/*" in line and "-" in line:
                label, description = [i.strip(" ") for i in line.split("*")[1].split("-", 1)]
                label = label.replace(' & ', '_').lower()
                sas_data[label] = {'description': description}
            elif '=' in line and ';' not in line:
                temp_data.append([i.strip(' ').strip("'").title() for i in line.split('=')])
            elif len(temp_data) > 0:
                sas_data[label]['data'] = temp_data
                temp_data = []
        return sas_data

In [36]:
sas_data = process_sas_labels_descriptions()

In [49]:
countries_df = pd.DataFrame(sas_data['i94cit_i94res']['data'], columns=['country_code', 'country'])
countries_df['country'] = countries_df["country"].replace(to_replace=["No Country.*", "INVALID.*", "Collapsed.*", "Invalid.*"], value="Other", regex=True)
countries_df['country'] = countries_df['country'].str.upper()

In [39]:
ports_df = pd.DataFrame(sas_data['i94port']['data'], columns=['port_code', 'port_of_entry'])
ports_df['port_code'] = ports_df['port_code'].str.upper()
ports_df['port_of_entry'] = ports_df["port_of_entry"].replace(to_replace=["No Port Code.*", "Collapsed.*"], value="Other,Other", regex=True)
ports_df[['city', 'state']] = ports_df['port_of_entry'].str.rsplit(',', 1, expand=True)
ports_df['city'] = ports_df['city'].str.upper()
ports_df['state'] = ports_df['state'].str.strip()
ports_df['state'] = ports_df['state'].str.upper()
ports_df.drop(['port_of_entry'], axis=1, inplace=True)

In [6]:
states_df = pd.DataFrame(sas_data['i94addr']['data'], columns=['code', 'state'])
states_df['code'] = states_df['code'].str.upper()
states_df['state'] = states_df['state'].str.upper()

In [7]:
visas_df = pd.DataFrame(sas_data['i94visa']['data'], columns=['code', 'reason_for_travel'])

In [5]:
sas_data['i94visa']['data']

[['1', 'Business'], ['2', 'Pleasure'], ['3', 'Student']]

In [50]:
countries_df.head()

  country_code                                            country
0          582  MEXICO AIR SEA, AND NOT REPORTED (I-94, NO LAN...
1          236                                        AFGHANISTAN
2          101                                            ALBANIA
3          316                                            ALGERIA
4          102                                            ANDORRA

In [52]:
countries_df.to_csv('countries.csv', sep=',', index=False)

In [14]:
sample_immig_df.head()

,Unnamed: 0,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,depdate,i94bir,i94visa,count,dtadfile,visapost,occup,entdepa,entdepd,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,2027561,4084316.0,2016.0,4.0,209.0,209.0,HHW,20566.0,1.0,HI,20573.0,61.0,2.0,1.0,20160422,NaN,NaN,G,O,NaN,M,1955.0,07202016,F,NaN,JL,5.658267e+10,00782,WT
1,2171295,4422636.0,2016.0,4.0,582.0,582.0,MCA,20567.0,1.0,TX,20568.0,26.0,2.0,1.0,20160423,MTR,NaN,G,R,NaN,M,1990.0,10222016,M,NaN,*GA,9.436200e+10,XBLNG,B2
2,589494,1195600.0,2016.0,4.0,148.0,112.0,OGG,20551.0,1.0,FL,20571.0,76.0,2.0,1.0,20160407,NaN,NaN,G,O,NaN,M,1940.0,07052016,M,NaN,LH,5.578047e+10,00464,WT
3,2631158,5291768.0,2016.0,4.0,297.0,297.0,LOS,20572.0,1.0,CA,20581.0,25.0,2.0,1.0,20160428,DOH,NaN,G,O,NaN,M,1991.0,10272016,M,NaN,QR,9.478970e+10,00739,B2
4,3032257,985523.0,2016.0,4.0,111.0,111.0,CHM,20550.0,3.0,NY,20553.0,19.0,2.0,1.0,20160406,NaN,NaN,Z,K,NaN,M,1997.0,07042016,F,NaN,NaN,4.232257e+10,LAND,WT

#### Process temperature dataset

In [49]:
temperature_df['datetime'] = pd.to_datetime(temperature_df.dt)
temperature_df.drop(['dt'], axis=1, inplace=True)

In [50]:
temperature_df['datetime'].describe()

count                 8599212
unique                   3239
top       1939-11-01 00:00:00
freq                     3510
first     1743-11-01 00:00:00
last      2013-09-01 00:00:00
Name: datetime, dtype: object

In [55]:
temperature_df = temperature_df[temperature_df['Country'] == 'United States']

In [56]:
# Since 1970 the global average temperature has been rising at a rate of 1.7°C per century, 
# compared to a long-term decline over the past 7,000 years at a baseline rate of 0.01°C per century
temperature_df = temperature_df[temperature_df['datetime']>"1970-01-01"].copy()

In [59]:
temperature_df.isna().sum()

AverageTemperature               1
AverageTemperatureUncertainty    1
City                             0
Country                          0
Latitude                         0
Longitude                        0
datetime                         0
dtype: int64

In [61]:
temperature_df[temperature_df.AverageTemperature.isna()]

,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,datetime
287781,NaN,NaN,Anchorage,United States,61.88N,151.13W,2013-09-01

In [70]:
temperature_df.shape

(134668, 7)

In [77]:
temperature_df[temperature_df[['datetime', 'City']].duplicated()].tail()

,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,datetime
7148658,14.309,0.331,Springfield,United States,42.59N,72.00W,2013-05-01
7148659,19.313,0.353,Springfield,United States,42.59N,72.00W,2013-06-01
7148660,23.629,0.447,Springfield,United States,42.59N,72.00W,2013-07-01
7148661,19.579,0.336,Springfield,United States,42.59N,72.00W,2013-08-01
7148662,15.883,1.368,Springfield,United States,42.59N,72.00W,2013-09-01

In [146]:
# Seems like there are readings of the same city taken at the same date
temperature_df[(temperature_df['City'] == 'Springfield') & (temperature_df['datetime'] == "2013-05-01")]

,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude,datetime
7142180,17.999,0.230,Springfield,United States,37.78N,93.56W,2013-05-01
7145419,18.889,0.164,Springfield,United States,39.38N,89.48W,2013-05-01
7148658,14.309,0.331,Springfield,United States,42.59N,72.00W,2013-05-01

In [147]:
# for consistency lets rename columns
temperature_df.rename(columns={
    'AverageTemperature': 'average_temperature', 
    'AverageTemperatureUncertainty': 'average_temperature_uncertainty',
    'City': 'city', 
    'Country': 'country',
    'Latitude': 'latitude',
    'Longitude': 'longitude',
}, inplace=True)

#### Process airports dataset

In [125]:
# iso_country column contains 247 null values
airports_df.isnull().sum()

ident               0
type                0
name                0
elevation_ft     7006
continent       27719
iso_country       247
iso_region          0
municipality     5676
gps_code        14045
iata_code       45886
local_code      26389
coordinates         0
dtype: int64

In [126]:
airports_df['iso_country'].value_counts()

US    22757
BR     4334
CA     2784
AU     1963
KR     1376
MX     1181
RU     1040
DE      947
GB      911
FR      850
AR      848
CO      706
IT      671
PG      593
VE      592
ZA      489
CL      474
ID      470
ES      416
CN      404
KE      372
IN      341
CD      285
PH      282
PL      278
CZ      269
JP      234
NO      228
SE      224
NZ      212
      ...
BN        2
MC        2
DM        2
SH        2
RE        2
AD        2
LC        2
SM        2
KN        2
PM        2
MF        2
IO        1
NF        1
JE        1
VA        1
BL        1
YT        1
CC        1
GM        1
SX        1
NU        1
CW        1
NR        1
MO        1
AW        1
GI        1
AI        1
CX        1
LI        1
MQ        1
Name: iso_country, Length: 243, dtype: int64

In [127]:
# we will only be taking airports data from the United States just like temperature dataset
airports_df = airports_df[airports_df['iso_country'] == 'US']

In [128]:
airports_df.shape

(22757, 12)

In [103]:
airports_df.isnull().sum()

ident               0
type                0
name                0
elevation_ft      239
continent       22756
iso_country         0
iso_region          0
municipality      102
gps_code         1773
iata_code       20738
local_code       1521
coordinates         0
dtype: int64

In [104]:
# we'll use municipality to join with city in our datasets and extract states from the iso_region
# lets remove rows with 102 missing municipality
airports_df[airports_df.municipality.isnull()].head()

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
1544,15SD,heliport,Watertown / Brownlee Heliport,1720.0,NaN,US,US-SD,NaN,15SD,NaN,NaN,"-97.1080899239, 44.883264878199995"
2452,21ID,heliport,Nordman / Phillabaum Heliport,2440.0,NaN,US,US-ID,NaN,21ID,NaN,NaN,"-116.871174574, 48.631483378700004"
4401,3ME7,seaplane_base,Peru / Destiny Cove SPB,580.0,NaN,US,US-ME,NaN,3ME7,NaN,NaN,"-70.396957, 44.460597"
7653,6XA4,small_airport,Zadow Airstrip,NaN,NaN,US,US-TX,NaN,6XA4,NaN,NaN,"-95.954353809, 29.991738550900003"
7887,74xa,small_airport,Gun Barrel City Airpark,385.0,NaN,US,US-TX,NaN,74XA,NaN,NaN,"-96.1456650496, 32.3551499558"

In [134]:
airports_df.shape

(22655, 12)

In [131]:
airports_df = airports_df[~airports_df.municipality.isnull()].copy()

In [133]:
airports_df['municipality'] = airports_df['municipality'].str.upper()

In [116]:
airports_df[airports_df['iso_region'].str.len() > 5]

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
49334,US-0319,small_airport,Ronnie Cole,900.0,NaN,US,US-U-A,GREENFIELD,NaN,NaN,NaN,"-85.72268, 39.831008"
49399,US-0384,closed,Beacon Station Air Strip,NaN,NaN,US,US-U-A,BAKER,NaN,NaN,NaN,"-116.20977, 35.13047"
49820,US-0805,small_airport,Twin Cities,NaN,NaN,US,US-U-A,"TABOR CITY,NC",K5J9,NaN,NaN,"0, 0"
49947,US-0932,small_airport,CLE,NaN,NaN,US,US-U-A,CLEVELAND,NaN,NaN,NaN,"0, 0"

In [136]:
# removing invalid iso_region values
airports_df = airports_df[airports_df['iso_region'].str.match(r'^[A-Z]+-[A-Z]+$')]

In [144]:
airports_df[['country', 'state']] = airports_df['iso_region'].str.strip().str.split('-', 1, expand=True)
airports_df.drop(['country'], axis=1, inplace=True)

In [145]:
airports_df.head()

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates,state
0,00A,heliport,Total Rf Heliport,11.0,NaN,US,US-PA,BENSALEM,00A,NaN,00A,"-74.93360137939453, 40.07080078125",PA
1,00AA,small_airport,Aero B Ranch Airport,3435.0,NaN,US,US-KS,LEOTI,00AA,NaN,00AA,"-101.473911, 38.704022",KS
2,00AK,small_airport,Lowell Field,450.0,NaN,US,US-AK,ANCHOR POINT,00AK,NaN,00AK,"-151.695999146, 59.94919968",AK
3,00AL,small_airport,Epps Airpark,820.0,NaN,US,US-AL,HARVEST,00AL,NaN,00AL,"-86.77030181884766, 34.86479949951172",AL
4,00AR,closed,Newport Hospital & Clinic Heliport,237.0,NaN,US,US-AR,NEWPORT,NaN,NaN,NaN,"-91.254898, 35.6087",AR

#### Process demographics dataset

In [149]:
demographics_df.shape

(2891, 12)

In [154]:
demographics_df.city = demographics_df.city.str.upper().str.strip()

In [155]:
demographics_df.isna().sum()

city                       0
state                      0
median_age                 0
male_population            3
female_population          3
total_population           0
number_of_veterans        13
foreign_born              13
average_household_size    16
state_code                 0
race                       0
count                      0
dtype: int64

In [156]:
# city and state must be our primary key lets find out
demographics_df[demographics_df[['state','city']].duplicated()].head()

,city,state,median_age,male_population,female_population,total_population,number_of_veterans,foreign_born,average_household_size,state_code,race,count
11,FOLSOM,California,40.9,41051.0,35317.0,76368,4187.0,13234.0,2.62,CA,American Indian and Alaska Native,998
14,WICHITA,Kansas,34.6,192354.0,197601.0,389955,23978.0,40270.0,2.56,KS,American Indian and Alaska Native,8791
55,OMAHA,Nebraska,34.2,218789.0,225098.0,443887,24503.0,48263.0,2.47,NE,Black or African-American,64223
77,WACO,Texas,29.3,63452.0,68890.0,132342,10716.0,14235.0,2.57,TX,Asian,4230
86,LYNN,Massachusetts,34.8,44598.0,47861.0,92459,3093.0,29899.0,2.81,MA,Asian,9205

In [157]:
# as there are multiple races living in state,city combination, lets add races in the mix
demographics_df[demographics_df[['state','city','race']].duplicated()].head()

Empty DataFrame
Columns: [city, state, median_age, male_population, female_population, total_population, number_of_veterans, foreign_born, average_household_size, state_code, race, count]
Index: []

In [166]:
immigration_df.printSchema()

root
 |-- cicid: double (nullable = true)
 |-- i94yr: double (nullable = true)
 |-- i94mon: double (nullable = true)
 |-- i94cit: double (nullable = true)
 |-- i94res: double (nullable = true)
 |-- i94port: string (nullable = true)
 |-- arrdate: double (nullable = true)
 |-- i94mode: double (nullable = true)
 |-- i94addr: string (nullable = true)
 |-- depdate: double (nullable = true)
 |-- i94bir: double (nullable = true)
 |-- i94visa: double (nullable = true)
 |-- count: double (nullable = true)
 |-- dtadfile: string (nullable = true)
 |-- visapost: string (nullable = true)
 |-- occup: string (nullable = true)
 |-- entdepa: string (nullable = true)
 |-- entdepd: string (nullable = true)
 |-- entdepu: string (nullable = true)
 |-- matflag: string (nullable = true)
 |-- biryear: double (nullable = true)
 |-- dtaddto: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- insnum: string (nullable = true)
 |-- airline: string (nullable = true)
 |-- admnum: double (nullable = true)
 |-- fltno: string (nullable = true)
 |-- visatype: string (nullable = true)

#### These are the datasets we have so far
- **immigration_df**: spark dataframe
- **airports_df**: pandas dataframe
- **demographics_df**: pandas dataframe
- **temperature_df**: pandas dataframe
- **countries_df**: pandas dataframe
- **states_df**: pandas dataframe
- **ports_df**: pandas dataframe
- **visas_df**: pandas dataframe

#### Process immigration dataset
We will be using SAS Labels description datasets we processed earlier: countries, states, ports and visas

In [168]:
immigration_df.createOrReplaceTempView("immigration_table")

In [171]:
visas_df_spark = spark.createDataFrame(visas_df)

In [174]:
visas_df_spark.printSchema()

root
 |-- code: string (nullable = true)
 |-- reason_for_travel: string (nullable = true)

In [173]:
visas_df_spark.createOrReplaceTempView("visas_table")

In [169]:
spark.sql("""
SELECT DISTINCT i94visa
FROM immigration_table
""").show()

+-------+
|i94visa|
+-------+
|    1.0|
|    3.0|
|    2.0|
+-------+

In [183]:
spark.sql("""
SELECT im.*, vt.reason_for_travel
FROM immigration_table im
JOIN visas_table vt
ON im.i94visa = CAST(vt.code as FLOAT)
""").createOrReplaceTempView("immigration_table")

In [187]:
# All dates in SAS correspond to the number of days since 1960-01-01. 
spark.sql("""
SELECT *, 
CASE 
    WHEN depdate >= 1.0 THEN date_add(to_date('1960-01-01'), depdate)
    WHEN depdate IS NULL THEN NULL
    ELSE 'N/A'
END AS departure_date 
FROM immigration_table
""").createOrReplaceTempView("immigration_table")

In [192]:
spark.sql("""
SELECT *, 
CASE 
    WHEN arrdate >= 1.0 THEN date_add(to_date('1960-01-01'), arrdate)
    WHEN arrdate IS NULL THEN NULL
    ELSE 'N/A'
END AS arrival_date 
FROM immigration_table
""").createOrReplaceTempView("immigration_table")

In [202]:
spark.sql("""
SELECT * FROM immigration_table
WHERE departure_date >= arrival_date
""").createOrReplaceTempView("immigration_table")

In [205]:
# checking count of common dates between arrival date and departure date for datetime dimension table
spark.sql("""
SELECT COUNT(DISTINCT departure_date) 
FROM immigration_table 
WHERE departure_date IN (
SELECT DISTINCT arrival_date FROM immigration_table
)
""").show()

+------------------------------+
|count(DISTINCT departure_date)|
+------------------------------+
|                            29|
+------------------------------+

In [203]:
spark.sql("""
SELECT * FROM immigration_table
""").count()

2953481

In [206]:
print(spark.sql("""
SELECT * FROM immigration_table LIMIT 5
""").toPandas())

   cicid   i94yr  i94mon  i94cit  i94res i94port  arrdate  i94mode i94addr  \
0   18.0  2016.0     4.0   101.0   101.0     NYC  20545.0      1.0      MI
1   22.0  2016.0     4.0   101.0   101.0     NYC  20545.0      1.0      NY
2   27.0  2016.0     4.0   101.0   101.0     BOS  20545.0      1.0      MA
3   28.0  2016.0     4.0   101.0   101.0     ATL  20545.0      1.0      MA
4   40.0  2016.0     4.0   101.0   101.0     CHI  20545.0      1.0      IL

   depdate  i94bir  i94visa  count  dtadfile visapost occup entdepa entdepd  \
0  20555.0    57.0      1.0    1.0  20160401     None  None       O       O
1  20562.0    48.0      1.0    1.0  20160401     None  None       O       O
2  20549.0    58.0      1.0    1.0  20160401      TIA  None       G       O
3  20549.0    56.0      1.0    1.0  20160401      TIA  None       G       O
4  20554.0    35.0      1.0    1.0  20160401      TIA  None       G       O

  entdepu matflag  biryear   dtaddto gender insnum airline        admnum  \
0    None       M   1959.0  09302016   None   None      AZ  9.247104e+10
1    None       M   1968.0  09302016   None   None      AZ  9.247849e+10
2    None       M   1958.0  04062016      M   None      LH  9.247876e+10
3    None       M   1960.0  04062016      F   None      LH  9.247890e+10
4    None       M   1981.0  09302016      M   None      OS  9.248056e+10

   fltno visatype reason_for_travel departure_date arrival_date
0  00602       B1          Business     2016-04-11   2016-04-01
1  00608       B1          Business     2016-04-18   2016-04-01
2  00422       B1          Business     2016-04-05   2016-04-01
3  00422       B1          Business     2016-04-05   2016-04-01
4  00065       B1          Business     2016-04-10   2016-04-01

In [199]:
spark.sql("SELECT count(*) FROM immigration_table WHERE departure_date IS NULL").show()

+--------+
|count(1)|
+--------+
|  142457|
+--------+

### Step 3: Define the Data Model
#### 3.1 Conceptual Data Model
Map out the conceptual data model and explain why you chose that model

#### 3.2 Mapping Out Data Pipelines
List the steps necessary to pipeline the data into the chosen data model

### Step 4: Run Pipelines to Model the Data 
#### 4.1 Create the data model
Build the data pipelines to create the data model.

In [ ]:
# Write code here

#### 4.2 Data Quality Checks
Explain the data quality checks you'll perform to ensure the pipeline ran as expected. These could include:
 * Integrity constraints on the relational database (e.g., unique key, data type, etc.)
 * Unit tests for the scripts to ensure they are doing the right thing
 * Source/Count checks to ensure completeness
 
Run Quality Checks

In [ ]:
# Perform quality checks here

#### 4.3 Data dictionary 
Create a data dictionary for your data model. For each field, provide a brief description of what the data is and where it came from. You can include the data dictionary in the notebook or in a separate file.

#### Step 5: Complete Project Write Up
* Clearly state the rationale for the choice of tools and technologies for the project.
* Propose how often the data should be updated and why.
* Write a description of how you would approach the problem differently under the following scenarios:
 * The data was increased by 100x.
 * The data populates a dashboard that must be updated on a daily basis by 7am every day.
 * The database needed to be accessed by 100+ people.